165/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.Соглашения</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

165/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанныеТаблицы = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекущиеДанныеТаблицы.Сумма = ТекущиеДанныеТаблицы.Цена;
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры




&НаСервере
Процедура СписокНоменклатурыСуммаПриИзмененииНаСервере()
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	СписокНоменклатурыСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КурсEURПриИзменении(Элемент)
	Если Объект.КурсEUR <> 0 Тогда
		Объект.СуммаEUR = Объект.СуммаПоДокументу / Объект.КурсEUR;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КурсUSDПриИзменении(Элемент)
	Если Объект.КурсUSD <> 0 Тогда
		Объект.СуммаUSD = Объект.СуммаПоДокументу / Объект.КурсUSD;
	КонецЕсли;
КонецПроцедуры
